#include "std_lib_facilities.h"

int main()
{

	cout << "..............................................................................................................................." << "\n\n";
	int born = 2001;
	cout << born << "\t(decimal)\n"
	<< hex << born << "\t(hexadecimal)\n"
	<< oct << born << "\t(octal)\n"
	<< dec << endl;
	
	cout << ".............................................................................................................................." << "\n\n";

	cout << "With showbase:\n"; //számrendszeralapja

		cout << showbase; 				
		cout << born << "\t(decimal)\n" 	
		<< hex << born << "\t(hexadecimal)\n" 	
		<< oct << born << "\t(octal)\n"
		<< dec << endl;

	cout << noshowbase << dec;

	cout << ".............................................................................................................................." << "\n\n";

/*
	int a, b, c, d;
	cin >> a >>oct >> b >> hex >> c >> d;
	cout << a << '\t'<< b << '\t'<< c << '\t'<< d << '\n' ;
*/

	cout << defaultfloat <<  1234567.89 << "\t(defaultfloat)\n";
	cout << fixed << 1234567.89 << "\t(fixed)\n";
	cout << scientific << 1234567.89 << "\t(scientific)\n";
	cout << endl;


	cout << ".............................................................................................................................." << "\n\n";

	cout << '|' << setw(10) << "Bezerédi" << '|' << setw(6) << "Erik" << '|' <<  setw(13) << "066000000660" << '|' << setw(20) << "valami2@mailbox.hu" << '|';
	cout << endl;
	cout << '|' << setw(10) << "Barátom" << '|' << setw(6) << "Neve" << '|' <<  setw(13) << "600000066006" << '|' << setw(20) << "valami@mailbox.hu" << '|';




	cout << "\n\n" << ".............................................................................................................................."<< "\n\n";
	return 0;
}